In [2]:
import pandas as pd
import glob
import numpy as np

In [3]:
pd.options.display.max_rows

60

In [4]:
pd.set_option('display.max_rows',1000)

In [5]:
path =r'C:\Users\Zachary.Clement\Desktop\cs\work\cems_work/cems_data'
allFiles = glob.glob(path + '/*.csv')
frame = pd.DataFrame()
list_ = []
count = 0
for file_ in allFiles:
    if count > 100:break
    df = pd.read_csv(file_, index_col = None, header = 0, usecols = [0,1,2,3,4,5,6,7])
    list_.append(df)
    print(count)
    count += 1
frame = pd.concat(list_)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100

In [6]:
frame.head()

,STATE,FACILITY_NAME,ORISPL_CODE,UNITID,OP_DATE,OP_HOUR,OP_TIME,GLOAD (MW)
0,AL,Barry,3,1,01-01-2015,0,0.0,NaN
1,AL,Barry,3,1,01-01-2015,1,0.0,NaN
2,AL,Barry,3,1,01-01-2015,2,0.0,NaN
3,AL,Barry,3,1,01-01-2015,3,0.0,NaN
4,AL,Barry,3,1,01-01-2015,4,0.0,NaN

In [7]:
frame.to_csv('2015cemsTest.csv')